tap "felixkratz/formulae"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mike-engel/jwt-cli"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
brew "xz"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "atuin"
brew "autoconf"
brew "automake"
brew "libssh2"
brew "bat"
brew "berkeley-db", link: true
brew "btop"
brew "glib"
brew "cairo"
brew "clang-format"
brew "cmus"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "libsndfile"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fx"
brew "fzf"
brew "gcc"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "go"
brew "gperftools"
brew "gpgme"
brew "python@3.12"
brew "shared-mime-info"
brew "libheif"
brew "libtool"
brew "hey"
brew "htmlq"
brew "python@3.13"
brew "httpie"
brew "liblqr"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "just"
brew "lazygit"
brew "ldns"
brew "libfido2"
brew "libgccjit"
brew "pkgconf"
brew "librsvg"
brew "libslirp"
brew "libxt"
brew "libxmu"
brew "miller"
brew "nasm"
brew "neovim"
brew "python@3.11"
brew "newt"
brew "ngrep"
brew "nmap"
brew "node"
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "poppler"
brew "procs"
brew "pup"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "qt"
brew "qt@5"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "rustup"
brew "sdl2_image"
brew "sevenzip"
brew "socat"
brew "starship"
brew "telnet"
brew "timg"
brew "tlrc"
brew "tree"
brew "unar"
brew "uv"
brew "watch"
brew "wget"
brew "xsv"
brew "yarn"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "mike-engel/jwt-cli/jwt-cli"
cask "aerospace"
cask "font-jetbrains-mono-nerd-font"
cask "keepassxc"
cask "kitty"
cask "ngrok"
cask "raycast"
cask "vlc"
