# VS Code Extensions
# Install with: cat extensions.txt | xargs -L 1 code --install-extension

# ============================================================================
# CORE - Neovim integration
# ============================================================================
asvetliakov.vscode-neovim

# ============================================================================
# AI ASSISTANTS
# ============================================================================
anthropic.claude-code
# github.copilot
# github.copilot-chat

# ============================================================================
# NAVIGATION & PRODUCTIVITY
# ============================================================================
alefragnani.numbered-bookmarks
# vscodevim.vim                    # Alternative if vscode-neovim has issues

# ============================================================================
# GIT
# ============================================================================
eamodio.gitlens
mhutchie.git-graph

# ============================================================================
# APPEARANCE
# ============================================================================
enkia.tokyo-night
pkief.material-icon-theme

# ============================================================================
# LANGUAGE SUPPORT
# ============================================================================
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
charliermarsh.ruff
# rust-lang.rust-analyzer
# golang.go
# ms-vscode.cpptools

# ============================================================================
# WEB DEVELOPMENT
# ============================================================================
# dbaeumer.vscode-eslint
# esbenp.prettier-vscode
# bradlc.vscode-tailwindcss

# ============================================================================
# REMOTE DEVELOPMENT
# ============================================================================
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-containers
# ms-vscode-remote.remote-wsl

# ============================================================================
# UTILITIES
# ============================================================================
usernamehw.errorlens
streetsidesoftware.code-spell-checker
gruntfuggly.todo-tree
wayou.vscode-todo-highlight
editorconfig.editorconfig
